CREATE TABLE Сотрудники (
    Id SERIAL,
    ФИО CHARACTER VARYING(30) NOT NULL,
    "Дата рождения" DATE NOT NULL,
	"Дата начала работы" DATE NOT NULL,
	Должность CHARACTER VARYING(40) NOT NULL,
	"Уровень сотрудника" CHARACTER VARYING(10) NOT NULL,
	"Уровень зарплаты" INT NOT NULL,
	"Идентификатор отдела" INT NOT NULL,
	"Наличие/отсутствие прав" BOOLEAN NOT NULL,
    PRIMARY KEY(Id)
);

INSERT INTO Сотрудники
    (ФИО, "Дата рождения", "Дата начала работы", Должность, "Уровень сотрудника", "Уровень зарплаты", "Идентификатор отдела", "Наличие/отсутствие прав")
VALUES
    ('Вольская А.Д.', '1974/08/25', '2011/07/16', 'разработчик', 'senior', 230000, 200, TRUE),
    ('Еремина П.П.', '1979/08/04', '2009/01/01', 'разработчик', 'middle', 120000, 200, FALSE),
    ('Заяц В.Д.', '1981/12/10', '2015/02/05', 'разработчик', 'middle', 135000, 200, FALSE),
    ('Иванова А.С.', '1986/09/30', '2014/06/08', 'зам. главного бухгалтера', 'senior', 280000, 4, TRUE),
	('Фирсова Н.Л.', '1995/08/16', '2013/09/09', 'бухгалтер', 'junior', 65000, 4, TRUE),
	('Козаков Р.Л.', '2000/06/22', '2021/12/10', 'разработчик', 'junior', 68000, 200, FALSE),
	('Усманов В.Д.', '2002/05/18', '2020/11/11', 'бухгалтер', 'junior', 60000, 4, TRUE),
	('Щетинина Е.Д.', '1994/09/06', '2009/10/14', 'разработчик', 'senior', 232000, 200, TRUE),
	('Уткина А.Р.', '1965/07/30', '2006/02/16', 'разработчик', 'lead', 450000, 200, TRUE),
	('Соломина А.А.', '1984/10/28', '2011/03/15', 'бухгалтер', 'middle', 165000, 4, FALSE),
	('Петров А.А.', '1983/03/02', '2013/02/18', 'разработчик', 'junior', 60000, 200, TRUE),
	('Сидоров В.В.', '1988/04/17', '2006/04/27', 'разработчик', 'lead', 450000, 200, TRUE),
	('Сорозов К.Б.', '1992/04/03', '2020/06/21', 'операционист', 'junior', 45000, 4, FALSE),
	('Погодин П.П.', '2003/11/23', '2022/07/29', 'разработчик', 'junior', 60000, 200, TRUE)
;