-- Задача 2.3_6 Когорта "Lite"
-- Пункт №1
SELECT Id, ФИО, ('2022-11-04' - Сотрудники."Дата начала работы") AS "Стаж, дней"
FROM Сотрудники;

-- Пункт №2
SELECT Id, ФИО, ('2022-11-04' - Сотрудники."Дата начала работы") AS "Стаж, дней"
FROM Сотрудники
OFFSET 0 ROWS FETCH NEXT 3 ROWS ONLY;

-- Пункт №3
SELECT Id
FROM Сотрудники
WHERE "Наличие/отсутствие прав" = TRUE;

-- Пункт №4
SELECT (Id)
FROM Кварталы
WHERE ("квартал1" = 'D' OR "квартал1" = 'E' OR
	  "квартал2" = 'D' OR "квартал2" = 'E' OR 
	  "квартал3" = 'D' OR "квартал3" = 'E' OR
	  "квартал4" = 'D' OR "квартал4" = 'E')
;

-- Пункт №5
SELECT MAX("Уровень зарплаты") AS "Макс. зарплата"
FROM "Сотрудники"